{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v3.21.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "15"}, {"size": "63"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "81"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/gru/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/gru/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/model/gru/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/gru/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/gru/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/gru/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/gru/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/gru/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/gru/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "63"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/max_pooling1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/output/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/output/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}, {"size": "63"}]}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/model/gru/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_41", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/model/gru/PartitionedCall/unstack-folded-0"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/model/gru/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_43", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/model/gru/PartitionedCall/unstack-folded-1"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["input", "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_51", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_87"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_52", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_41", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_88"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_42", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_89"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_54", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_43", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_90"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_82"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_80"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims", "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims_1", "StatefulPartitionedCall/model/conv1d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_83"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/conv1d/Conv1D"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv1d/Relu", "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/model/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/batch_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/conv1d_1/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/conv1d_1/Conv1D/ExpandDims", "StatefulPartitionedCall/model/conv1d_1/Conv1D/ExpandDims_1", "StatefulPartitionedCall/model/conv1d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/conv1d_1/Conv1D"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/conv1d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv1d_1/Relu", "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/max_pooling1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/batch_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/model/max_pooling1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/max_pooling1d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/max_pooling1d/ExpandDims"], "attr": {"strides": {"list": {"i": ["1", "2", "1", "1"]}}, "ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model/max_pooling1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/max_pooling1d/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/model/gru/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/max_pooling1d/Squeeze"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/max_pooling1d/Squeeze", "StatefulPartitionedCall/model/gru/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/gru/Shape", "StatefulPartitionedCall/model/gru/strided_slice/stack", "StatefulPartitionedCall/model/gru/strided_slice/stack_1", "StatefulPartitionedCall/model/gru/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/transpose", "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/gru/strided_slice", "StatefulPartitionedCall/model/gru/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/Shape", "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/gru/zeros/packed", "StatefulPartitionedCall/model/gru/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_86"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/model/gru/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_85"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_84"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/cond/_31/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_49", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_44"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55", "op": "LoopCond", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/cond/_31/while/Less"]}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_24_switch/_63", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_51", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/unstack_switch/_64", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_52", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_23_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_25_switch/_65", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_53", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/unstack_switch/_66", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_54", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/time_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_counter_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/model/gru/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67", "op": "Identity", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_counter_switch/_56:1"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/exit/_71", "op": "Exit", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1_switch/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/sub/x", "op": "Const", "input": ["^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_86", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_62:1", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_87", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_24_switch/_63:1", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_88", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/unstack_switch/_64:1", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split_1/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_89", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_25_switch/_65:1", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_23_switch/_60:1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_25_switch/_65:1", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_90", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/unstack_switch/_66:1", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_4/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_5/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_85", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_switch/_61:1", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/exit/_71", "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_62:1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/time_switch/_58:1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/BiasAdd_1", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/MatMul_1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/unstack_switch/_66:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/time_switch/_58:1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_4/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_counter_switch/_56:1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_5/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_24_switch/_63:1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/unstack_switch/_64:1"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split_1", "op": "Split", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split_1/split_dim", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/BiasAdd_1"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_4", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_5", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split", "op": "Split", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split/split_dim", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/BiasAdd"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/output/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/output/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split:1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/output/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/output/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/Sigmoid", "StatefulPartitionedCall/model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/model/gru/PartitionedCall/input/_23_switch/_60:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/sub/x", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/Sigmoid_1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split_1:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split:2", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/sub", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/mul_1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_3", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1_switch/_59:1", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_3"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/next_iteration/_83", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_body_control/_67"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/Read/ReadVariableOp", "shape": [128, 384], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/gru/PartitionedCall/unstack-folded-0", "shape": [384], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/gru/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/gru/Read_1/ReadVariableOp", "shape": [128, 384], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/gru/PartitionedCall/unstack-folded-1", "shape": [384], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims_1", "shape": [1, 3, 63, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv1d/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv1d_1/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv1d_1/Conv1D/ExpandDims_1", "shape": [1, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv1d_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/max_pooling1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/output/MatMul/ReadVariableOp", "shape": [128, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/output/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Write/TensorListSetItem/index", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/sub/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/split_1/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_4/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/gru/PartitionedCall/while/body/_32/while/add_5/y", "shape": [], "dtype": "int32"}]}]}